## [testpr](https://daniellem97.app.spacelift.io/stack/testpr/run/01J2C02Y6MW9HE2HPJJK7HVV5G) plan logs

<details>
<summary>Click here to expand</summary>

```
[01J2AFMMQM95NT0R88YA4CB69H] Planning changes with 1 custom hook...
data.terraform_remote_state.demo-stack-state: Reading...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # random_string.example will be created
  + resource "random_string" "example" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = true
      + upper       = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + dev_ip2 = (sensitive value)
  + trigger = (known after apply)
╷
│ Error: Error loading state error
│ 
│   with data.terraform_remote_state.demo-stack-state,
│   on datasources.tf line 12, in data "terraform_remote_state" "demo-stack-state":
│   12:   backend = "remote"
│ 
│ error loading the remote state: Error creating workspace demo-stack: cannot
│ create a workspace
╵
╷
│ Error: Missing required argument
│ 
│   on providers.tf line 10, in provider "aws":
│   10: provider "aws" {
│ 
│ The argument "region" is required, but no definition was found.
╵
[01J2AFMMQM95NT0R88YA4CB69H] Unexpected exit code when planning changes: 1
```

</details>